Repository: ZekriDev1/TilawaLock
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# appTitle
source: TilawaLock
ar: تلاوة لوك

# tagline
source: Discipline begins with recitation.
ar: الانضباط يبدأ بالتلاوة.
fr: La discipline commence par la récitation.

source: Get Started
ar: ابدأ الآن
fr: Commencer

source: Next
ar: التالي
fr: Suivant

source: Skip
ar: تخطي
fr: Passer

# permissionsTitle
source: Required Permissions
ar: الأذونات المطلوبة
fr: Autorisations Requises

# permissionsSubtitle
source: TilawaLock needs these permissions to help you stay disciplined.
ar: يحتاج تطبيق تلاوة لوك إلى هذه الأذونات لمساعدتك على الانضباط.
fr: TilawaLock a besoin de ces autorisations pour vous aider à rester discipliné.

source: Microphone
ar: الميكروفون

# microphoneDesc
source: Required for Quran recitation matching.
ar: مطلوب لمطابقة تلاوة القرآن.
fr: Requis pour la correspondance de la récitation du Coran.

# usageStats
source: Usage Statistics
ar: إحصائيات الاستخدام
fr: Statistiques d'utilisation

# usageStatsDesc
source: Used to monitor and limit distracting apps.
ar: يستخدم لمراقبة وتقييد التطبيقات المشتتة.
fr: Utilisé pour surveiller et limiter les applications distrayantes.

source: Notifications
ar: الإشعارات

# notificationsDesc
source: To send reminders and session alerts.
ar: لإرسال التذكيرات وتنبيهات الجلسة.
fr: Pour envoyer des rappels et des alertes de session.

# overlay
source: System Overlay
ar: ظهور فوق التطبيقات
fr: Superposition Système

# overlayDesc
source: Required to show the lock screen over other apps.
ar: مطلوب لإظهار شاشة القفل فوق التطبيقات الأخرى.
fr: Requis pour afficher l'écran de verrouillage sur d'autres applications.

source: Allow
ar: سماح
fr: Autoriser

# continueText
source: Continue
ar: متابعة
fr: Continuer

# selectApps
source: Select Apps to Lock
ar: اختر التطبيقات للقفل
fr: Sélectionner les applications à verrouiller

source: Search apps...
ar: ابحث عن التطبيقات...
fr: Rechercher des applications...

source: Usage Limit
ar: حد الاستخدام
fr: Limite d'utilisation

source: Daily Allowed Usage
ar: الاستخدام اليومي المسموح به
fr: Utilisation quotidienne autorisée

# usageLimitDesc
source: How much time would you like to allow yourself for selected apps each day?
ar: كم من الوقت تود السماح لنفسك باستخدام التطبيقات المختارة يومياً؟
fr: Combien de temps souhaitez-vous vous accorder pour les applications sélectionnées chaque jour ?

# minutes
source: {count, plural, =1{1 minute} other{{count} minutes}}
ar: {count, plural, =1{دقيقة واحدة} =2{دقيقتان} other{{count} دقائق}}

# hours
source: {count, plural, =1{1 hour} other{{count} hours}}
ar: {count, plural, =1{ساعة واحدة} =2{ساعتان} other{{count} ساعات}}
fr: {count, plural, =1{1 heure} other{{count} heures}}

source: Custom minutes...
ar: دقائق مخصصة...
fr: Minutes personnalisées...

source: Recitation Setup
ar: إعداد التلاوة
fr: Configuration de la récitation

source: Recitation Requirement
ar: متطلبات التلاوة
fr: Exigence de récitation

source: Difficulty Level
ar: مستوى الصعوبة
fr: Niveau de difficulté

source: Finish Setup
ar: إنهاء الإعداد
fr: Terminer la configuration

source: Easy
ar: سهل
fr: Facile

# easyDesc
source: Word matching only
ar: مطابقة الكلمات فقط
fr: Correspondance de mots uniquement

source: Standard
ar: قياسي

# standardDesc
source: Pronunciation match
ar: مطابقة النطق
fr: Correspondance de prononciation

source: Strict
ar: صعب

# strictDesc
source: High accuracy tajweed
ar: تجويد بدقة عالية
fr: Tajweed de haute précision

# homeGreeting
source: As-salamu alaykum
ar: السلام عليكم

source: Daily Recitation
ar: التلاوة اليومية
fr: Récitation Quotidienne

source: Streak
ar: التتابُع
fr: Série

source: Points
ar: النقاط

# days
source: {count, plural, =1{1 Day} other{{count} Days}}
ar: {count, plural, =1{يوم واحد} =2{يومان} other{{count} أيام}}
fr: {count, plural, =1{1 Jour} other{{count} Jours}}

source: Apps Blocked
ar: تطبيقات محجوبة
fr: Applications Bloquées

source: Time Saved
ar: الوقت الموفر
fr: Temps Économisé

source: Achievements
ar: الإنجازات
fr: Succès

source: Recite Now
ar: اتلُ الآن
fr: Réciter Maintenant

source: Time for Tilawa
ar: وقت التلاوة
fr: Il est temps de lire

# lockMessage
source: You've reached your limit. Recite 5 ayat to continue using this app.
ar: لقد وصلت إلى الحد المسموح به. اتلُ 5 آيات لمتابعة استخدام هذا التطبيق.
fr: Vous avez atteint votre limite. Récitez 5 versets pour continuer à utiliser cette application.

source: Start Recitation
ar: ابدأ التلاوة
fr: Commencer la récitation

# closeAndDiscipline
source: Close & Discipline
ar: أغلق وانضبط
fr: Fermer et se discipliner

# verseCounter
source: Verse {current} of {total}
ar: الآية {current} من {total}
fr: Verset {current} sur {total}

source: Listening...
ar: جاري الاستماع...
fr: Écoute en cours...

source: Tap to Recite
ar: اضغط للتلاوة
fr: Appuyer pour réciter

source: Masha'Allah!
ar: ما شاء الله!

# successMessage
source: Recitation completed successfully. Session restored.
ar: تمت التلاوة بنجاح. تم استعادة الجلسة.
fr: Récitation terminée avec succès. Session restaurée.

source: Finish
ar: إنهاء
fr: Terminer

source: Settings
ar: الإعدادات
fr: Paramètres

source: Language
ar: اللغة
fr: Langue

source: Arabic
ar: العربية
fr: Arabe

source: English
ar: الإنجليزية
fr: Anglais

source: French
ar: الفرنسية
fr: Français

source: Ramadan Mode
ar: وضع رمضان
fr: Mode Ramadan

# ramadanModeDesc
source: Stricter limits and higher rewards during the holy month.
ar: قيود أكثر صرامة ومكافآت أعلى خلال الشهر الفضيل.
fr: Limites plus strictes et récompenses plus élevées pendant le mois sacré.

source: Strict Recitation
ar: تلاوة دقيقة
fr: Récitation Stricte
